[
	{
    "_id": {
        "$oid": "59e2cdee3bc7a8646a000012"
    }
    ,
    "body": "REGISTER HERE: <a href=\"https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803\">https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803</a> <br />  <br /> OCTOBER WORKSHOP:  <br /> “PRESENT” YOURSELF TO SUCCESS IN YOUR BUSINESS <br />  <br /> Whether you are a new business owner or seasoned entrepreneur, you benefit greatly by improving your public speaking skills. Whether you’re presenting to a group of potential clients about your product or service or pitching to investors or lenders, you need to be effective in getting your message across. <br /> Common concerns you might face before &amp; during a presentation can include: Do I come across as knowledgeable and credible? Am I being engaging enough and generating enough interest in my prospects? Can they tell I’m nervous? Can I answer questions convincingly? <br /> This workshop program is based on the Amazon Best Selling book /“Present” Yourself in Public Speaking – Tell Your Inner Critic to SHUT UP! And the Real You to SPEAK UP! /You will receive effective tools to bypass your inner critic and allow your authentic and most confident self to shine through. <br /> Break through to a new level of public speaking that will get you noticed! <br /> REGISTER HERE: <a href=\"https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803\">https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803</a> <br />  <br /> PRESENTER BIO <br /> Mary Cheyne, MBA, has trained over 15,000 people in over 25 cities around the world and has coached hundreds of individuals on how to communicate clearly &amp; authentically in front of audiences. She taught communications-related classes at Northeastern University in Boston for 7 years and is the author of the Amazon Best Selling book /“Present” Yourself in Public Speaking. /Mary is the 2009 /World Championship of Public Speaking/ second place winner out of 25,000 contestants from 14 countries. <br /> ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ <br /> REGISTER HERE: <a href=\"https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803\">https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803</a> <br />  <br /> The National Association of Professional Women (NAPW) is an exclusive network for professional women to interact, exchange ideas, learn and empower each other. NAPW members enjoy a wealth of resources, benefits and services dedicated to enhancing their lives and promoting their businesses and careers. <br />  <br /> If you have a space, office, store you would like to showcase and become a venue partner for any of our networking events' locations - please reach out to me at angela@thesocialbutterfly.co <br />  <br /> To get e-Connected with the NAPW network check out the: <br /> Virtual eChapter Group: <a href=\"http://www.napw.com/chapters/napw-e-chapter\">http://www.napw.com/chapters/napw-e-chapter</a> <br />  <br /> REGISTER HERE: <a href=\"https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803\">https://www.eventbrite.com/e/present-yourself-to-success-in-your-career-tickets-38444589803</a> <br />  <br /> The Social Butterfly Lifestyle Solutions, Inc  <br /> On a Journey2Empower,Connect,Inspire Professionals acrossGeographic&amp;SocioeconomicBoundaries. #personalbranding #thebusinessdoctor",
    "created_at": {
        "$date": "2017-10-14T21:54:38.584-0500"
    }
    ,
    "external_message": false,
    "of_type": "group",
    "old_data": {}
    ,
    "receiver_ids": [ 
		{
        "$oid": "545b8ae479fb6943a4000276"
    }
    ,
    {
        "$oid": "54aa1332790f3e5b00000794"
    }
    ,
    {
        "$oid": "5488b03f790f3e65000008bf"
    }
    ],
    "sender_id": {
        "$oid": "54e43cc2a91e14a78000b9e7"
    }
    ,
    "subject": "Register Soon!! NAPW Boston Workshop Series [THUR OCT19]",
    "updated_at": {
        "$date": "2017-10-14T21:54:38.584-0500"
    }
},
 {
	 
 }
]